[
  {
    "title": "BC Environment NLP Pipeline",
    "desc": "Developed a comprehensive NLP pipeline for processing scanned environmental PDFs at the Government of British Columbia. Implemented document classification using regex patterns and BERT models, built duplicate detection with ROUGE and RapidFuzz algorithms, and integrated local LLM fallbacks with Ollama for robust processing capabilities. The system demonstrates strong performance in text metadata extraction, reliably detects potential duplicates, and makes conservative but highly accurate positive releasability predictions.",
    "links": [
      {
        "label": "Repository",
        "href": "https://github.com/bcgov/nr-site-tagging-pilot"
      },
      {
        "label": "Documentation",
        "href": "https://github.com/bcgov/nr-site-tagging-pilot/blob/main/README.md"
      }
    ],
    "image": "https://images.unsplash.com/photo-1551288049-bebda4e38f71?w=400&h=300&fit=crop",
    "category": "NLP",
    "impact": "Delivers strong metadata extraction, comprehensive duplicate detection, and cautious but highly accurate positive releasability predictions"
  },
  {
    "title": "Lay Summarization Pipeline",
    "desc": "Built a modular biomedical lay-summarization system comparing zero-shot, few-shot, fine-tuned, and retrieval-augmented approaches. On limited hardware, abstract-only LLaMA2 provided the best overall balance of relevance and readability, while RAG improved factual grounding. The pipeline includes an evaluation harness for ROUGE, BLEU, BERTScore, FKGL, CLI, DCRS, and SummaC.",
    "links": [
      {
        "label": "Repository",
        "href": "https://github.com/jnadal14/Lay_Summarization_LLM_Pipeline"
      }
    ],
    "image": "https://images.unsplash.com/photo-1559757148-5c350d0d3c56?w=400&h=300&fit=crop",
    "category": "NLP",
    "impact": "Abstract-only LLaMA2 outperformed fine-tuned variants on limited hardware, and the RAG variant achieved the strongest factuality by SummaC"
  },
  
  {
    "title": "Detoxification LLM Dataflow",
    "desc": "Engineered a sophisticated data curation and toxicity reduction workflow for large language models. Designed filtering mechanisms for translation sentiment analysis and implemented detoxification stages with reproducible runs. The system ensures AI-generated content meets safety standards while maintaining quality and coherence.",
    "links": [
      {
        "label": "Repository",
        "href": "https://github.com/jnadal14/Detoxification_LLM_Dataflow"
      },
      {
        "label": "Paper",
        "href": "https://github.com/jnadal14/Detoxification_LLM_Dataflow/blob/main/Final_Report.pdf"
      }
    ],
    "image": "https://images.unsplash.com/photo-1518709268805-4e9042af2176?w=400&h=300&fit=crop",
    "category": "ML",
    "impact": "Reduced toxic content.%"
  },
  {
    "title": "Movie Review Corpus and UI",
    "desc": "Created a comprehensive movie review corpus with custom annotation schema and an intuitive exploration interface. Developed comparison frameworks for GPT-style annotations against human labels, providing insights into AI-human annotation alignment. The system supports large-scale sentiment analysis research.",
    "links": [
      {
        "label": "Repository",
        "href": "https://github.com/jnadal14/Movie_Review_Corpus_Annotation"
      }
    ],
    "image": "https://images.unsplash.com/photo-1489599849927-2ee91cede3ba?w=400&h=300&fit=crop",
    "category": "Data Science",
    "impact": "Prototyped a sentiment analysis research tool."
  }
]